{
  "items": [
    {
      "id": "urheilupaivakirja (Sport Diary)",
      "created": ["2024/07"],
      "image": "/projectImages/UPK-512x512.png",
      "title": "Urheilupäiväkirja",
      "description": "A comprehensive web application designed to help students and teachers track workout activities and academic progress. Students can log their workouts, monitor their training intensity, and track their progress toward course goals. Teachers can oversee student activity, analyze training data, and provide feedback to ensure students meet their physical education objectives. The application fosters a collaborative environment between students and educators, promoting accountability and motivation",
      "key_features": [
        "User authentication for students and teachers.",
        "Workout logging with details such as duration, intensity, and type.",
        "Progress tracking and visualization for students.",
        "Teacher dashboard for monitoring student activity with Week / Month / Year views.",
        "Integration with school course progression systems. Teacher can modify the students course requirements and the students can see their progress towards the course goals."
      ],
      "technical_highlights": [
        "Built with React for a dynamic and responsive frontend.",
        "Styled using TailwindCSS for a modern and customizable UI.",
        "Backend powered by Node.js and Express for robust API handling.",
        "Data stored and managed in a mySQL database for scalability and reliability."
      ],
      "stack": ["React", "TailwindCSS", "Node.js", "Express", "mySQL"],
      "github": "https://github.com/K4naxa/Urheilupaivakirja",
      "documentation": "https://github.com/K4naxa/urheilupaivakirja-dokumentaatio",
      "demo": ""
    },

    {
      "id": "charity-auction",
      "created": ["2024/11"],
      "image": "/projectImages/MahdollisuuksienKirppis_landingpage.png",
      "title": "Charity Auction",
      "description": "A professional landing page designed for a charity auction event, showcasing the event's purpose, auction items, and participation rules. The page includes a registration form for attendees who want to participate in the auction. Built with a 0€ budget, the project demonstrates resourcefulness and creativity. Wordpress was chosen as the CMS to ensure ease of maintenance and future updates by non-techinal users.",
      "key_features": [
        "Event details clearly displayed for attendees.",
        "Registration form uses captcha to prevent spam.",
        "Responsive design for seamless use across devices.",
        "Easy to update, and maintain by non-technical users."
      ],
      "technical_highlights": [
        "Auction made possible by using woocommerces customized review system as a bidding system.",
        "Auction 'Live updates' made possible by using timed AJAX requests that update the review fields every 5 seconds.",
        "Customized Wordpress theme to match the event's branding and style."
      ],
      "stack": ["Wordpress", "Elementor", "WooCommerce"],
      "github": "",
      "documentation": "https://github.com/K4naxa/mahdollisuuksienkirppis_documents",
      "demo": ""
    },

    {
      "id": "barrocos-bostons",
      "created": ["2024/1"],
      "image": "/projectImages/Barrocos-Logo.jpg",
      "title": "Barrocos Bostons",
      "description": "A fully-featured website created for a dog breeder to showcase their breeding program, dogs, and puppies. The site includes detailed profiles for each dog, a blog for updates, and a contact form for inquiries. Built with a 0€ budget, the project prioritized the breeder's needs, including dual-language support (Finnish and English) and an intuitive content management system. The site uses WooCommerce to categorize dogs by litter and gender, and Elementor for easy editing.",
      "key_features": [
        "Dual-language support using Polylang",
        "Search functionality for easy navigation.",
        "Blog section for sharing updates and stories and achievements.",
        "WooCommerce integration for organizing dog profiles.",
        "Contact form for inquiries and communication"
      ],
      "technical_highlights": [
        "Built on WordPress for ease of maintenance.",
        "Enhanced with Elementor for drag-and-drop editing.",
        "Integrated WooCommerce for structured content management.",
        "Utilized Polylang for seamless multilingual support."
      ],
      "stack": ["Wordpress", "Elementor", "WooCommerce", "Polylang"],
      "github": "",
      "documentation": "",
      "live": "https://www.barrocos.net/",
      "demo": ""
    },
    {
      "id": "landing-page",
      "created": ["2025/2"],
      "image": "/projectImages/landing-page-favi.png",
      "title": "Personal Landing Page",
      "description": "A personal landing page built with Vue 3, designed to showcase my skills, projects, and experience as a full-stack web developer. This site serves as a central hub for potential clients and employers to learn about my capabilities and get in touch. Security is a priority, with reCAPTCHA v3 integrated into the contact form and CV download process to prevent spam and abuse as well as keep my personal information safe.",
      "key_features": [
        "Responsive design for optimal viewing on all devices.",
        "Interactive sections for showcasing projects, skills, and experience.",
        "Contact form with reCAPTCHA v3 integration for secure communication.",
        "CV download feature protected by reCAPTCHA v3 to prevent automated downloads."
      ],
      "technical_highlights": [
        "Frontend developed with Vue 3 and styled with Tailwind CSS for a modern and responsive design.",
        "Implements reCAPTCHA v3 on the contact form and CV download to ensure security and prevent spam.",
        "Uses Vue3-Toastify for user feedback.",
        "Uses Axios for API calls.",
        "Mobile swipe navigation for easy browsing on touch devices.",
        "Mobile swipe backwards closes the current open modal."
      ],
      "stack": ["Vue3", "TailwindCSS", "FastAPI"],
      "github": "https://github.com/K4naxa/landing-page",
      "documentation": "",
      "demo": ""
    },

    {
      "id": "worksheet-tracker",
      "created": ["2025/07"],
      "image": "https://github.com/K4naxa/worksheet/blob/main/Other/applicationLogo.png?raw=true",
      "title": "Työpäiväkirja (Internship Tracker)",
      "description": "A full-stack web application designed to help students track their daily activities, learnings, and progress during their internships. Built with a modern tech stack, it offers a seamless, responsive, and installable PWA experience for a native-app feel.",
      "key_features": [
        "Daily Logging: Easily add, view, and edit daily entries for work activities and learnings.",
        "Interactive Calendar: A visual, monthly overview of your workdays.",
        "Statistical Analysis: Automatically calculates total hours, workdays, and other key metrics.",
        "Secure Authentication: Robust user management and authentication powered by Keycloak.",
        "Progressive Web App (PWA): Installable on mobile and desktop for a native-app feel and offline access.",
        "Data Export: Export your entire work log to an Excel (.xlsx) file for official reporting."
      ],
      "technical_highlights": [
        "Full-stack application built with Next.js (App Router) and NestJS.",
        "Secure user authentication and management handled by Keycloak and NextAuth.js.",
        "Data stored in a PostgreSQL database.",
        "Designed as an installable Progressive Web App (PWA) for offline access and a native-like experience.",
        "Deployed using Docker and Docker Compose for consistency across environments."
      ],
      "stack": ["Next.js", "React", "TailwindCSS", "NestJS", "Keycloak", "PostgreSQL", "Docker"],
      "github": "https://github.com/K4naxa/worksheet",
      "documentation": "",
      "demo": ""
    }
  ]
}
